yihansolo/2920_stm32_lab2and3/engn2920_lab3/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LX2_limit_right_Pin GPIO_PIN_3
#define LX2_limit_right_GPIO_Port GPIOF
#define Y_direction_Pin GPIO_PIN_4
#define Y_direction_GPIO_Port GPIOF
#define Y_enable_actlo_Pin GPIO_PIN_5
#define Y_enable_actlo_GPIO_Port GPIOF
#define X_direction_Pin GPIO_PIN_7
#define X_direction_GPIO_Port GPIOE
#define LX1_limit_left_Pin GPIO_PIN_11
#define LX1_limit_left_GPIO_Port GPIOE
#define X_enable_actlo_Pin GPIO_PIN_15
#define X_enable_actlo_GPIO_Port GPIOE
#define Z_enable_actlo_Pin GPIO_PIN_10
#define Z_enable_actlo_GPIO_Port GPIOD
#define LY2_limit_bot_Pin GPIO_PIN_12
#define LY2_limit_bot_GPIO_Port GPIOD
#define LY1_limit_top_Pin GPIO_PIN_13
#define LY1_limit_top_GPIO_Port GPIOD
#define Z_direction_Pin GPIO_PIN_5
#define Z_direction_GPIO_Port GPIOG

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
